pureDEM/test2/openHFDIB-STL/inclineAngle-20deg/polyhedron_20-sided/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames ("sphere");

interpolationSchemes
{
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     1e-3;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep true;

outputSetup
{
    basic true;
    iB  true;
    DEM true;
    addModel false;
    parallelDEM true;
}
DEM
{
    materials
    {
        particle
        {
            Y       1e8;
            nu      0.0;
            mu      1;
            adhN    0;
			eps	 	1;
        }
        
        wall
        {
            Y       1e8;
            nu      0.0;
            mu      1;
            adhN    0;
			eps	 	1;
        }
    }
    LcCoeff 4;
    collisionPatches
    {
		wall
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.0 0.0 0.0);
		}
    }

}

virtualMesh
{
    level 4;
    charCellSize 1e-3; 
    recordContact false;
}

sphere
{
	fullyCoupledBody;
	rho         rho [1 -3 0 0 0 0 0] 5000;
	refineMC 5;
	U
	{
		BC  noSlip;
	}
	bodyAddition
	{
		addModel   once;
		onceCoeffs{}

	}	
	material particle;
	bodyGeom convex;
	updateTorque true;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 2;
	timesToSetStatic -1;	
}
// ************************************************************************* //

